{"class_name": "Model", "keras_version": "2.0.3", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 100, 256, 320], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Reshape", "config": {"target_shape": [100, 256, 320, 1], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "reshape_1"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_1", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "conv3d_1"}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_1", "trainable": true, "data_format": "channels_last", "pool_size": [5, 2, 2], "padding": "same", "strides": [5, 2, 2]}, "inbound_nodes": [[["conv3d_1", 0, 0, {}]]], "name": "max_pooling3d_1"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]], "name": "conv3d_2"}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2, 2], "padding": "same", "strides": [2, 2, 2]}, "inbound_nodes": [[["conv3d_2", 0, 0, {}]]], "name": "max_pooling3d_2"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_3", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]], "name": "conv3d_3"}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_3", "trainable": true, "data_format": "channels_last", "pool_size": [1, 2, 2], "padding": "same", "strides": [1, 2, 2]}, "inbound_nodes": [[["conv3d_3", 0, 0, {}]]], "name": "max_pooling3d_3"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_4", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["max_pooling3d_3", 0, 0, {}]]], "name": "conv3d_4"}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_4", "trainable": true, "data_format": "channels_last", "pool_size": [1, 2, 2], "padding": "same", "strides": [1, 2, 2]}, "inbound_nodes": [[["conv3d_4", 0, 0, {}]]], "name": "max_pooling3d_4"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_5", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["max_pooling3d_4", 0, 0, {}]]], "name": "conv3d_5"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling3d_1", "size": [1, 2, 2]}, "inbound_nodes": [[["conv3d_5", 0, 0, {}]]], "name": "up_sampling3d_1"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_6", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["up_sampling3d_1", 0, 0, {}]]], "name": "conv3d_6"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling3d_2", "size": [1, 2, 2]}, "inbound_nodes": [[["conv3d_6", 0, 0, {}]]], "name": "up_sampling3d_2"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_7", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["up_sampling3d_2", 0, 0, {}]]], "name": "conv3d_7"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling3d_3", "size": [2, 2, 2]}, "inbound_nodes": [[["conv3d_7", 0, 0, {}]]], "name": "up_sampling3d_3"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_8", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["up_sampling3d_3", 0, 0, {}]]], "name": "conv3d_8"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling3d_4", "size": [5, 2, 2]}, "inbound_nodes": [[["conv3d_8", 0, 0, {}]]], "name": "up_sampling3d_4"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_9", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["up_sampling3d_4", 0, 0, {}]]], "name": "conv3d_9"}, {"class_name": "Reshape", "config": {"target_shape": [100, 256, 320], "trainable": true, "name": "reshape_2"}, "inbound_nodes": [[["conv3d_9", 0, 0, {}]]], "name": "reshape_2"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["reshape_2", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}